In [2]:
import pandas as pd
s = pd.Series(['Banana', 42], index=['fav', 'age'])
print(s)

fav    Banana
age        42
dtype: object

In [7]:
s = pd.Series(['wes Mckinney','Creater Of Pandas'], index=['Player', 'God of Pandas'])
print(s)

Player                wes Mckinney
God of Pandas    Creater Of Pandas
dtype: object

In [11]:
# 데이터프레임에서는 DataFrame()을 사용한다!! - 즉 D,F 는 대문자!!
# 인덱스가 있을 때,
df = pd.DataFrame({
    "Name" : ['Rosaline Franklin', 'William Gosset'],
    'Occupation' : ['Chemist', 'Statisstician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16'],
    'Age' : [37, 61]
})
print(df)

                Name     Occupation        Born        Died  Age
0  Rosaline Franklin        Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statisstician  1876-06-13  1937-10-16   61

In [3]:
# 인덱스가 없을 때,!! ( 이 경우, 사람 이름을 변수로 탐지하지 않는다는 것!! )
df = pd.DataFrame(data={
    'Occupation' : ['Chemist', 'Statisstician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16'],
    'Age' : [37, 61]
}, index=['Rosaline Franklin', 'William Gosset'], columns=['Occupation','Born','Age','Died'])
print(df)

                      Occupation        Born  Age        Died
Rosaline Franklin        Chemist  1920-07-25   37  1958-04-16
William Gosset     Statisstician  1876-06-13   61  1937-10-16

In [7]:
# 딕셔너리 구조 데이터 추출
# 순서를 보장하는 데이터프레임 구조

from collections import OrderedDict
df = pd.DataFrame(OrderedDict([
        ('Name', ['Rosaline Franklin', 'William Gosset']),
        ('Occupation', ['Chemist', 'Statisstician']),
        ('Born', ['1920-07-25', '1876-06-13']),
        ('Died', ['1958-04-16', '1937-10-16']),
        ('Age', [37, 61])
]))
print(df)

                Name     Occupation        Born        Died  Age
0  Rosaline Franklin        Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statisstician  1876-06-13  1937-10-16   61

In [8]:
df = pd.DataFrame(data={
    'Occupation' : ['Chemist', 'Statisstician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16'],
    'Age' : [37, 61]
}, index=['Rosaline Franklin', 'William Gosset'], columns=['Occupation','Born','Age','Died'])
print(df)

                      Occupation        Born  Age        Died
Rosaline Franklin        Chemist  1920-07-25   37  1958-04-16
William Gosset     Statisstician  1876-06-13   61  1937-10-16

In [13]:
first_row = df.loc['William Gosset']
print(first_row)
print(type(first_row))

row_test = df.iloc[0]
print(row_test)
# loc, iloc의 출력은 series

Occupation    Statisstician
Born             1876-06-13
Age                      61
Died             1937-10-16
Name: William Gosset, dtype: object
<class 'pandas.core.series.Series'>
Occupation       Chemist
Born          1920-07-25
Age                   37
Died          1958-04-16
Name: Rosaline Franklin, dtype: object

In [11]:
# 시리즈의 인덱스 가져오기
first_row.index

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [15]:
# 시리즈의 값 가져오기
first_row.values
# 배열 데이터로 가져옴!

array(['Statisstician', '1876-06-13', 61, '1937-10-16'], dtype=object)

In [16]:
tad = df.tail(n=1)
print(tad)

                   Occupation        Born  Age        Died
William Gosset  Statisstician  1876-06-13   61  1937-10-16

In [22]:
first_row.index[[0]]

Index(['Occupation'], dtype='object')

In [21]:
first_row.values[[0, 1]]

array(['Statisstician', '1876-06-13'], dtype=object)

In [26]:
print(first_row.keys())
print(first_row.keys()[[0,1]])

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')
Index(['Occupation', 'Born'], dtype='object')

In [38]:
ages2 = df['Age']
print(ages2.mean())
ages2

49.0

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [34]:
ages2.min()

37

In [35]:
ages2.max()

61

In [36]:
ages.median()

49.0

In [37]:
ages.std()

16.97056274847714

In [41]:
ages = df['Age']
print(type(ages))

print(ages.mean())
print(ages.min())
print(ages.max())
print(ages.median())
print(ages.std())
print(ages.nunique)

<class 'pandas.core.series.Series'>
49.0
37
61
49.0
16.97056274847714
<bound method IndexOpsMixin.nunique of Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64>

In [45]:
ages4 = df[['Age', 'Born']]
print(ages4)
print(type(ages4))
#벡터의 값이 두개 이상일 떄, -> 데이터프레임
# 벡터의 값이 하나일 때, 시리즈

                   Age        Born
Rosaline Franklin   37  1920-07-25
William Gosset      61  1876-06-13
<class 'pandas.core.frame.DataFrame'>

In [46]:
print(ages4.mean())

Age    49.0
dtype: float64

C:\Users\starl\AppData\Local\Temp\ipykernel_28752\613470504.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(ages4.mean())

In [47]:
ages = df['Age']
print(type(ages))

print(ages.mean())
print(ages.min())
print(ages.max())
print(ages.median())
print(ages.std())
print(ages.nunique)

<class 'pandas.core.series.Series'>
49.0
37
61
49.0
16.97056274847714
<bound method IndexOpsMixin.nunique of Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64>

In [2]:
import pandas as pd
df = pd.read_csv('../data/scientists.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [66]:
ages = df['Age']
print(ages.mean())
print(ages.max())
# 표준편차
print(ages.std())

59.125
90
18.325918413937288

In [63]:
print(ages[ages > ages.mean()])
print(list(ages > ages.mean()))
print(ages > ages.mean())
print(type(ages > ages.mean()))
# 조건식은 시리즈 구조!!

1    61
2    90
3    66
7    77
Name: Age, dtype: int64
[False, True, True, True, False, False, False, True]
0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool
<class 'pandas.core.series.Series'>

In [67]:
# 평균보다 작은 사람
print(ages[ages > ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [71]:
MANUAL = [True, True, False, False, True, True, False, True]
print(ages[MANUAL])
print(ages[ages > ages.mean()])

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64
1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [72]:
print(ages + ages)
# 벡터 간 연산 ( n + n / 벡터 + 벡터 )

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [76]:
REVESE = ages.sort_index(ascending=False)
# 역순 정렬
# REVESE
print(ages * 2)
print(ages + REVESE)

print(df * 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

In [78]:
print(pd.Series([1, 100]))
print(ages + pd.Series([1, 100]))

0      1
1    100
dtype: int64
0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [79]:
print(df[df['Age'] > df['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [81]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
df = df[df['Age'] > df['Age'].mean()]

In [84]:
# 위에서 로드하지 않고 기존 데이터셋에서 불러옴
print(df.loc[[True, True, False, True, True, True, False, True]])

                Name        Born        Died  Age     Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37        Chemist
1     William Gosset  1876-06-13  1937-10-16   61   Statistician
3        Marie Curie  1867-11-07  1934-07-04   66        Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56      Biologist
5          John Snow  1813-03-15  1858-06-16   45      Physician
7       Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [85]:
df * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [86]:
print(df['Born'].dtypes)
print(df['Died'].dtypes)

object
object

In [4]:
died_datetime = pd.to_datetime(df['Died'], format="%Y-%m-%d")
Born_datetime = pd.to_datetime(df['Born'], format="%Y-%m-%d")
print(died_datetime)
live_time = died_datetime - Born_datetime
print(live_time)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]
0   13779 days
1   22404 days
2   32964 days
3   24345 days
4   20777 days
5   16529 days
6   15324 days
7   28422 days
dtype: timedelta64[ns]

In [6]:
df['Died_Datetime'], df['Born_Datetime'], df['Live_Days'] = (died_datetime, Born_datetime, live_time)
df

,Name,Born,Died,Age,Occupation,Died_Datetime,Born_Datetime,Live_Days
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1958-04-16,1920-07-25,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1937-10-16,1876-06-13,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1910-08-13,1820-05-12,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1934-07-04,1867-11-07,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1964-04-14,1907-05-27,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1858-06-16,1813-03-15,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1954-06-07,1912-06-23,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1855-02-23,1777-04-30,28422 days

In [92]:
df.shape

(8, 8)

In [7]:
xcp = df['Live_Days']
xcp / 365

0   37 days 18:00:59.178082191
1   61 days 09:08:23.013698630
2   90 days 07:29:45.205479452
3   66 days 16:46:01.643835616
4   56 days 22:09:32.054794520
5   45 days 06:50:18.082191780
6   41 days 23:36:19.726027397
7   77 days 20:50:37.808219178
Name: Live_Days, dtype: timedelta64[ns]

In [10]:
import pandas as pd
df['Age']
xcp = df['Live_Days']
xcp / 365

0   37 days 18:00:59.178082191
1   61 days 09:08:23.013698630
2   90 days 07:29:45.205479452
3   66 days 16:46:01.643835616
4   56 days 22:09:32.054794520
5   45 days 06:50:18.082191780
6   41 days 23:36:19.726027397
7   77 days 20:50:37.808219178
Name: Live_Days, dtype: timedelta64[ns]

In [12]:
born = pd.to_datetime(df['Born'], format="%Y-%m-%d")
born

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [13]:
df['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [28]:
import random
random.seed(42)  # 랜덤 시드 설정
df['shuffled'] = random.shuffle(df['Age'])
df['Age']

0    77
1    90
2    66
3    61
4    41
5    45
6    37
7    56
Name: Age, dtype: int64

In [25]:
df[['Age', 'shuffled']]

   Age shuffled
0   41     None
1   77     None
2   56     None
3   66     None
4   61     None
5   45     None
6   90     None
7   37     None

In [29]:
df.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'Died_Datetime',
       'Born_Datetime', 'Live_Days', 'shuffled'],
      dtype='object')

In [31]:
df_dropped = df.drop(['shuffled'], axis=1)
df_dropped.columns
# Axis – 행 / 열의 변수인지 알려줘야 한다 ( axis =1 -> 열/ columns / axis = 0 -> 행 / 레코드 )

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'Died_Datetime',
       'Born_Datetime', 'Live_Days'],
      dtype='object')

In [41]:
# 데이터 저장하고 불러오기
# 피클 : 데이터를 바이너리 형태로 직렬화된 오브젝트를 저장하는 기법
xs = df['Age']
xs.to_pickle('./pickle/series_Name.pickle')